In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.Series(10)

0    10
dtype: int64

In [3]:
pd.Series([10,20,30])

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(np.arange(20,30))

0    20
1    21
2    22
3    23
4    24
5    25
6    26
7    27
8    28
9    29
dtype: int32

In [5]:
a=pd.Series(range(100,200,10),dtype=float)

In [6]:
a.dtype

dtype('float64')

In [7]:
print(a)

0    100.0
1    110.0
2    120.0
3    130.0
4    140.0
5    150.0
6    160.0
7    170.0
8    180.0
9    190.0
dtype: float64

In [8]:
name=["Mohit","Ravi","Raju","Jayant","Akash"]
age=[30,32,51,19,21]

In [9]:
d={"name":name,"age":age}

In [10]:
d

{'name': ['Mohit', 'Ravi', 'Raju', 'Jayant', 'Akash'],
 'age': [30, 32, 51, 19, 21]}

In [11]:
df=pd.DataFrame(d)

In [12]:
df["name"]

0     Mohit
1      Ravi
2      Raju
3    Jayant
4     Akash
Name: name, dtype: object

In [13]:
df["age"]

0    30
1    32
2    51
3    19
4    21
Name: age, dtype: int64

In [14]:
df["location"]=["Ghaziabad","Noida","Delhi","mumbai","Banglore"]

In [15]:
df

     name  age   location
0   Mohit   30  Ghaziabad
1    Ravi   32      Noida
2    Raju   51      Delhi
3  Jayant   19     mumbai
4   Akash   21   Banglore

In [16]:
df["location"]

0    Ghaziabad
1        Noida
2        Delhi
3       mumbai
4     Banglore
Name: location, dtype: object

In [17]:
df["rank"]=range(300,315,3)

In [18]:
df

     name  age   location  rank
0   Mohit   30  Ghaziabad   300
1    Ravi   32      Noida   303
2    Raju   51      Delhi   306
3  Jayant   19     mumbai   309
4   Akash   21   Banglore   312

In [19]:
b=pd.Series(data=[10,20,30,40],index=[100,101,102,103])

In [20]:
b

100    10
101    20
102    30
103    40
dtype: int64

In [21]:
c=pd.Series(data=np.linspace(0,10,11),index=np.linspace(0,10,11)**2)

In [22]:
c

0.0       0.0
1.0       1.0
4.0       2.0
9.0       3.0
16.0      4.0
25.0      5.0
36.0      6.0
49.0      7.0
64.0      8.0
81.0      9.0
100.0    10.0
dtype: float64

In [23]:
d=pd.Series(data=range(10,20,2),index=range(20,30,2))

In [24]:
d

20    10
22    12
24    14
26    16
28    18
dtype: int64

In [25]:
dic={}
dic[1]="Jayant"
dic[2]="Hello"
dic[3]="World"
dic[4]="Vikrant"

In [26]:
a=pd.Series(data=list(dic.values()),index=list(dic.keys()))

In [27]:
pd.DataFrame(a)

         0
1   Jayant
2    Hello
3    World
4  Vikrant

In [30]:
e=pd.Series(dict(zip(age,name)))

In [31]:
e

30     Mohit
32      Ravi
51      Raju
19    Jayant
21     Akash
dtype: object

In [32]:
arr=np.random.randint(10,20,(5,5))

In [33]:
pd.DataFrame(arr)

    0   1   2   3   4
0  16  16  18  15  14
1  12  16  14  13  12
2  11  15  16  16  17
3  14  16  10  11  18
4  10  14  15  15  11

In [39]:
a=pd.DataFrame(arr,index=name,columns=["Physics","Maths","Chemistry","Biology","Computer Science"])

In [40]:
a

        Physics  Maths  Chemistry  Biology  Computer Science
Mohit        16     16         18       15                14
Ravi         12     16         14       13                12
Raju         11     15         16       16                17
Jayant       14     16         10       11                18
Akash        10     14         15       15                11

In [42]:
a.to_html("Data.html")

In [49]:
a.to_csv("data.csv")

In [50]:
a.to_json("Data.json")